касса_Вегас/src/Catalogs/ДрайверыОборудования/ДрайверыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДрайверыОборудования</name>
  <predefined>
    <items>
      <name>Драйвер1ССканерШтрихкода</name>
      <description>1С:Cканер штрихкода (Native)</description>
    </items>
    <items>
      <name>Драйвер1СДисплейПокупателяWin</name>
      <description>1С:Дисплей покупателя (Windows)</description>
    </items>
    <items>
      <name>Драйвер1СДрайверFPrint11</name>
      <description>1С:Драйвер FPrint-11</description>
    </items>
    <items>
      <name>Драйвер1СПринтерЧеков</name>
      <description>1С:Принтер чеков</description>
    </items>
    <items>
      <name>Драйвер1СУстройствоВвода</name>
      <description>1С:Устройство ввода</description>
    </items>
    <items>
      <name>ДрайверIboxProПлатежнаяСистема</name>
      <description>2Can:Сервис приема платежей</description>
    </items>
    <items>
      <name>ДрайверCASЭлектронныеВесыWin</name>
      <description>CAS:Электронные весы (Windows)</description>
    </items>
    <items>
      <name>ДрайверRightScanККТ54ФЗ</name>
      <description>RightScan:ККТ с передачей данных в ОФД (54-ФЗ)</description>
    </items>
    <items>
      <name>ДрайверRightScanУстройстваВвода</name>
      <description>RightScan:Устройства ввода данных ТСД Urovo</description>
    </items>
    <items>
      <name>ДрайверRightScanУстройствоПечати</name>
      <description>RightScan:Устройство печати ТСД Urovo</description>
    </items>
    <items>
      <name>ДрайверScanPortУстройстваВвода</name>
      <description>ScanPort:Устройства ввода данных</description>
    </items>
    <items>
      <name>ДрайверАЗУРККТ54ФЗ</name>
      <description>АЗУР:ККТ с передачей данных в ОФД (54-ФЗ)</description>
    </items>
    <items>
      <name>ДрайверАЗУРПлатежнаяСистема</name>
      <description>АЗУР:Платежная система</description>
    </items>
    <items>
      <name>ДрайверАТОЛККТ54ФЗ9X</name>
      <description>АТОЛ:ККТ с передачей данных в ОФД (54-ФЗ)</description>
    </items>
    <items>
      <name>ДрайверАТОЛККТ54ФЗ10X</name>
      <description>АТОЛ:ККТ с передачей данных в ОФД (54-ФЗ) 10.x</description>
    </items>
    <items>
      <name>ДрайверАТОЛЭлектронныеВесыWin</name>
      <description>АТОЛ:Электронные весы (Windows)</description>
    </items>
    <items>
      <name>ДрайверВерсияТККТ54ФЗ</name>
      <description>Версия-Т:ККТ с передачей данных в ОФД (54-ФЗ)</description>
    </items>
    <items>
      <name>ДрайверInpasПлатежнаяСистема</name>
      <description>ИНПАС:Эквайринг-терминал</description>
    </items>
    <items>
      <name>ДрайверСканситиУстройстваВвода</name>
      <description>СКАН СИТИ:Устройства ввода данных</description>
    </items>
    <items>
      <name>ДрайверСканкодСканерШтрихкода</name>
      <description>СКАНКОД:Cканер штрихкода Chipherlab (Native)</description>
    </items>
    <items>
      <name>ДрайверШтрихМККТ54ФЗ</name>
      <description>Штрих-М:ККТ с передачей данных в ОФД (54-ФЗ)</description>
    </items>
    <items>
      <name>ДрайверШтрихМККТ54ФЗWin</name>
      <description>Штрих-М:ККТ с передачей данных в ОФД (Windows)</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипОборудования</name>
    <type>
      <types>EnumRef.ТипыПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановкаИзМакета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияДрайвера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтеграционноеПриложение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

касса_Вегас/src/Catalogs/ДрайверыОборудования/ManagerModule.bsl
// Процедура заполняет предопределенные элементы в справочнике драйверов.
//
Процедура ЗаполнитьПредопределенныйЭлемент(ТипОборудования, ИмяДрайвера, НаименованиеДрайвера, ИдентификаторОбъекта, ИнтеграционноеПриложение, ВерсияДрайвера = Неопределено, УстановкаИзМакета = Истина) Экспорт
	
	Попытка
		Драйвер = МенеджерОборудованияВызовСервера.ПредопределенныйЭлемент("Справочник.ДрайверыОборудования." + ИмяДрайвера);
	Исключение
		Сообщение = НСтр("ru = 'Предопределенный элемент ""%Параметр%"" не найден.'");
		Сообщение = СтрЗаменить(Сообщение, "%Параметр%", "Справочник.ДрайверыОборудования." + ИмяДрайвера);
		ВызватьИсключение Сообщение;
	КонецПопытки;
		
	Если Драйвер = Неопределено Тогда  
		Драйвер = Справочники.ДрайверыОборудования.СоздатьЭлемент();
		Драйвер.ИмяПредопределенныхДанных = ИмяДрайвера;     
	Иначе 
		Драйвер = Драйвер.ПолучитьОбъект();
	КонецЕсли;
	Драйвер.ТипОборудования      = ТипОборудования;
	Драйвер.Наименование         = НаименованиеДрайвера;
	Драйвер.ИдентификаторОбъекта = ИдентификаторОбъекта;
	Драйвер.ИнтеграционноеПриложение = ИнтеграционноеПриложение;
	Драйвер.ВерсияДрайвера           = ВерсияДрайвера;
	Драйвер.УстановкаИзМакета        = УстановкаИзМакета;
	Драйвер.Записать();
	
КонецПроцедуры

// Функция возвращает список драйверов. 
//
Функция ПолучитьСписокДрайверов(Идентификатор = Неопределено) Экспорт

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДрайверыОборудования.Ссылка КАК Ссылка,
	|	ДрайверыОборудования.Наименование         КАК Наименование,
	|	ДрайверыОборудования.ТипОборудования      КАК ТипОборудования,
	|	ДрайверыОборудования.ИдентификаторОбъекта КАК ИдентификаторОбъекта,
	|	ДрайверыОборудования.УстановкаИзМакета    КАК УстановкаИзМакета,
	|	ДрайверыОборудования.ВерсияДрайвера       КАК ВерсияДрайвера,
	|	ДрайверыОборудования.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных, 
	|	ДрайверыОборудования.ИнтеграционноеПриложение  КАК ИнтеграционноеПриложение
	|ИЗ
	|	Справочник.ДрайверыОборудования КАК ДрайверыОборудования ";
	
	Если Идентификатор <> Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса + " ГДЕ (ДрайверыОборудования.Ссылка = &Идентификатор)"
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	// Установим параметры запроса (фильтрующие выборку значения)
	Если Идентификатор <> Неопределено Тогда
		// Фильтр по конкретному драйверу
		Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
		|УПОРЯДОЧИТЬ ПО
		|	ТипОборудования,
		|	Наименование;";

	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокДрайверов = Новый Массив();
	Пока Выборка.Следующий() Цикл
		ДанныеДрайвера = Новый Структура();
		ДанныеДрайвера.Вставить("Ссылка"                   , Выборка.Ссылка);
		ДанныеДрайвера.Вставить("Наименование"             , Выборка.Наименование);
		ДанныеДрайвера.Вставить("ТипОборудования"          , Выборка.ТипОборудования);
		ДанныеДрайвера.Вставить("ИдентификаторОбъекта"     , Выборка.ИдентификаторОбъекта);
		ДанныеДрайвера.Вставить("УстановкаИзМакета"        , Выборка.УстановкаИзМакета);
		ДанныеДрайвера.Вставить("ВерсияДрайвера"           , Выборка.ВерсияДрайвера);
		ДанныеДрайвера.Вставить("ИмяПредопределенныхДанных", Выборка.ИмяПредопределенныхДанных);
		ДанныеДрайвера.Вставить("ИнтеграционноеПриложение" , Выборка.ИнтеграционноеПриложение);
		СписокДрайверов.Добавить(ДанныеДрайвера);
	КонецЦикла;
	
	// Возвращаем полученный список с данными
	Возврат СписокДрайверов;
	
КонецФункции
